Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: In fact, in Lean's library, every concrete type other than the universes and every type constructor other than dependent arrows is an instance of a general family of type constructions known as inductive types.
ko: 사실 린의 라이브러리에서 세계보다는 모든 구체적인 유형과 의존 화살표 외에 모든 형 생성자는 inductive types으로 알려진 일반적인 유형 생성의 일종의 개체입니다.

source: In fact, in Lean, Subtype is defined using the structure command:
ko: 사실 린에서 Subtype은 구조체 명령을 사용해 정의됩니다.

source: In fact, more should be true: applying the expression (fun x : Nat => x) to 1 should "return" the value 1.
ko: 사실, 더 중요한건 표현식(fun x : Nat => x)을 1에 적용하는 것은 값 1을 "반환"하는 겁니다.

source: In fact, most such systems provide fully elaborated "proof objects" that can be communicated to other systems and checked independently.
ko: 사실, 그런 시스템의 대부분은 증명 대상과의 완전한 협력을 제공합니다. 이 대상은 다른 시스템과 상호작용될 수 있고 독립적으로 검증될 수 있습니다.

source: In fact, the notation is defined in Lean as follows:
ko: 사실 린에서 정의된 기호는 다음과 같습니다.

source: In fact, the function id is defined in the standard library in exactly this way.
ko: 사실 함수 id는 표준 라이브러리에서도 이와 정확히 동일한 방식으로 정의되어 있습니다.

source: In fact, the type Prop is syntactic sugar for Sort 0, the very bottom of the type hierarchy described in the last chapter.
ko: 사실 Prop형은 Sort 0에 대한 문법적 설탕입니다. 유형 계층의 최하층은 마지막 장에서 설명합니다.

source: In fact, there is a show tactic, which is similar to the show expression in a proof term.
ko: 사실 증명항에서 show 표현식과 비슷한 show 전략이 있습니다.

source: In fact, this is exactly how the logical connectives are defined.
ko: 사실 이것은 논리 결합자가 어떻게 정의되는가에 대한 것 입니다.

source: In fact, we can compress the full tactic down to one line:
ko: 사실, 우리는 완전한 전략을 한 줄로 압축시킬 수 있습니다.

source: In fact, with this notation, you can even omit both the type and the label, in which case the new fact is introduced with the label this.
ko: 사실 이 기호와 관련해서 여러분은 심지어 유형과 레이블 모두 생략할 수 있습니다. 그 경우 새로운 사실은 this 레이블로 도입됩니다.

source: In fact, you can use Lean's (t : T) notation to specify the class whose instance you are looking for, in a concise manner:
ko: 사실 여러분은 린의 (t : T) 기호로 여러분이 찾는 개체의 클래스를 엄밀하게 명시할 수 있습니다.

source: In full generality, the problem of determining whether a higher-order unifier exists is undecidable, and Lean can at best provide imperfect and approximate solutions to the problem.
ko: 완전 일반적으로 고차 통합자가 존재하는지 정하는 문제는 결정 불가능합니다. 그리고 린은 최선을 다해 이 문제에 부정확하지만 근사적인 해를 제공할 수 있습니다.

source: In general, a "construction" can depend on data, which is then represented in the constructed argument.
ko: 일반적으로 "생성"은 데이터에 의존할 수 있습니다. 그러면 그것은 생성된 인자에서 표현됩니다.

source: In general, it is important for you to be familiar with the library and its contents, so you know what theorems, definitions, notations, and resources are available to you.
ko: 일반적으로 여러분이 라이브러리와 그것의 내용물에 친숙해지는 것이 중요합니다. 그래야 여러분이 어떤 정리, 정의, 기호, 자원을 쓸 수 있는지 압니다.

source: In general, whenever we define a structure S, we usually define projection functions that allow us to "destruct" each instance of S and retrieve the values that are stored in its fields.
ko: 일반적으로 언제든 우리가 구조체 S를 정의하면 우리는 보통 S의 각 개체를 "파괴"할 수 있게 해주고 그 필드에 저장된 값을 인출할 수 있게 해주는 투영함수를 정의합니다.

source: In its most basic form, it is applied to an element x in the local context.
ko: 그것의 가장 기본 형태에서 이것은 지역 맥락에서 원소 x에 적용됩니다.

source: In light of that fact, Lean tags proofs as irreducible, which serves as a hint to the parser (more precisely, the elaborator) that there is generally no need to unfold it when processing a file.
ko: 그 사실에 비춰보면 린의 증명을 줄일 수 없는 것으로 태그한다. 그리고 그것은 파서(더 정확히는 협력기)에게 파일을 처리할 때 증명을 펼칠 필요가 없다는 힌트를 주는 역할을 합니다.

source: In many respects, however, a namespace ... end block behaves the same as a section ... end block.
ko: 하지만 여러 관점에서 namespace ... end블록은 section ... end블록과 동일하게 동작합니다.

source: In most cases, the first argument of Or.intro_right and Or.intro_left can be inferred automatically by Lean.
ko: 대게의 경우 Or.intro_right와 Or.intro_left의 첫번째 인수는 린에 의해 자동적으로 추론될 수 있습니다.

source: In normal circumstances, it is never necessary to unfold the "definition" of a theorem; by proof irrelevance, any two proofs of that theorem are definitionally equal.
ko: 평범한 상황에서 증명 무연관에 의해 정리의 "정의"를 펼칠 필요는 절대 없습니다. 그리고 그 정리의 임의의 두 증명도 정의상으로 동등합니다.

source: In other words, assuming α : Type is the first argument to the function, the type of the next two elements are α and List α.
ko: 다시 말하면 함수의 첫 번째 인수로 α : Type으로 가정하면 다음 두 원소의 유형은 α와 List α가 됩니다.

source: In other words, under the propositions-as-types correspondence, the proof by cases is a kind of definition by cases, where what is being "defined" is a proof instead of a piece of data.
ko: 다시 말하자면 유형으로써 명제 대응하에서 경우에 따른 증명은 경우에 따른 정의의 일종이고, 여기서 "정의되는" 것은 데이터의 조각 대신 증명입니다.

source: In other situations, however, reductions hold only propositionally, which is to say, they are equational theorems that must be applied explicitly.
ko: 하지만 다른 상황에서 축약은 명제적으로만 성립합니다. 즉, 명시적으로 적용해야 하는 등식 정리입니다.

source: In other words, True is simply true, and has a canonical proof, True.intro.
ko: 다시 말하자면 True는 단순히 참이고, 정식 증명 True.intro를 가집니다.

source: In other words, Lean parses the more general definitions, defines auxiliary inductive types based on them, and then uses the auxiliary types to define the ones we really want.
ko: 다시 말하면, 린은 더 일반적인 정의를 구문분석해 이들이 기반하는 부가적인 귀납형을 정의하고, 그 뒤 부가적인 유형을 우리가 원하는 것을 정의하는데 사용합니다.

source: In other words, s is a proof of p, t is a proof of the desired conclusion assuming h : p, and the two are combined by a lambda abstraction and application.
ko: 다시 말하자면 s는 p의 증명입니다. h : p를 가정한 t는 원하는 결론의 증명입니다. 그리고 이 둘은 람다 추상화와 적용으로 결합되어 있습니다.

source: In other words, double-negation elimination allows one to carry out a proof by contradiction, something which is not generally possible in constructive logic.
ko: 다시 말하자면 이중 부정 제거는 직관주의적 논리에서 일반적으로 불가능한 귀류법을 사용한 증명을 허용합니다.

source: In other words, for each unresolved placeholder, Lean reports the subgoal that needs to be filled at that point.
ko: 다시 말하자면 각 해결되지 않은 자리 차지자에 대해 린은 그 지점에서 채워져야 할 작은 목표를 보고합니다.

source: In other words, for every α, cons α is the function that takes an element a : α and a list as : List α, and returns a new list, so you have cons α a as : List α.
ko: 다시 말하면 모든 α에 대해 cons α는 원소 a : α와 리스트 as : List α를 받는 함수입니다. 그리고 새로운 리스트를 반환합니다. 그래서 여러분은 cons α a as : List α를 갖습니다.

source: In other words, if β is a proposition depending on α, then ∀ x : α, β is again a proposition.
ko: 다시 말해서, 만약 β가 α에 의존하는 명제라면 ∀ x : α, β도 다시 명제인 것입니다.

source: In other words, if you import Foo and Foo imports Bar, then you also have access to the contents of Bar, and do not need to import it explicitly.
ko: 다시 말하면, 여러분이 Foo를 부르고 Foo는 Bar를 불러온다면 여러분은 Bar의 내용에도 접근할 수 있습니다. 그리고 명시적으로 불러올 필요가 없습니다.

source: In other words, implication between propositions p and q corresponds to having a function that takes any element of p to an element of q.
ko: 다시 말하면, 명제 p과 q사이의 함의는 p의 원소에서 q의 원소로 가는 함수를 갖는 것에 대응된니다.

source: In other words, it is a proof by cases.
ko: 다시 말하자면 경우에 따라 증명한 것입니다.

source: In other words, the expressions themselves are the proofs.
ko: 다시 말하자면 표현식 그들 자체는 증명입니다.

source: In other words, the type of dependent functions from α to β "lives" in the universe whose index is the maximum of i and j.
ko: 다시 말하면, α에서 β로의 의존 함수 유형이 그것의 첨자가 i와 j 중 최대값인 유형세계에 "성립한다"입니다.

source: In other words, the type of the value returned by f depends on its input.
ko: 다시 말하자면 f에 의해 반환되는 값의 유형은 그것의 입력에 의존합니다.

source: In other words, the universe level u is required to be at least as large as the universe level of each type that represents an argument to a constructor.
ko: 다시 말하면, 세계 수준 u는 적어도 생성자에 대한 인자로 나타난 각 유형의 세계 수준 만큼이나 클 필요가 있음을 요구합니다.

source: In other words, whenever we have p : Prop, we can interpret p as a type, namely, the type of its proofs.
ko: 다시 말하자면, p : Prop를 갖는한 우리는p를 유형으로써 대게 그것의 증명형으로 해석할 수 있습니다.

source: In particular, if x has no predecessors, it is accessible.
ko: 특히 x의 전임자가 없다면 그것은 접근가능합니다.

source: In particular, we can define predicates on α by quantifying over all predicates on α, which is exactly the type of circularity that was once considered problematic.
ko: 특히, 우리는 α에 대한 술어를 α에 대한 모든 술어를 한정함으로써 정의할 수 있습니다. 그리고 이게 한때 문제라고 여겼던 순환 유형입니다.

source: In particular, if p is a true closed expression, decide p will reduce definitionally to the Boolean true.
ko: 특히, p가 정말로 닫힌 표현식이라면 decide p는 정의로부터 불리언 true로 축소됩니다.

source: In particular, if you use the variable command within a namespace, its scope is limited to the namespace.
ko: 특히, 이름공간 안에서 variable 명령을 사용한다면 그것의 범위는 이름공간으로 제한될 것입니다.

source: In particular, the following equations hold definitionally:
ko: 특히 다음 방정식은 정의로부터 성립합니다.

source: In particular, we can often write ⟨hp, hq⟩ instead of And.intro hp hq:
ko: 특히 And.intro hp hq대신 ⟨hp, hq⟩와 같이 쓸 수 있습니다.

source: In practice, there is not a sharp distinction between verifying a piece of mathematics and verifying the correctness of a system: formal verification requires describing hardware and software systems in mathematical terms, at which point establishing claims as to their correctness becomes a form of theorem proving.
ko: 실제로 수학의 일부를 식별하는 것과 시스템의 명확성을 식별하는 것 사이에 명확한 구분이 없습니다. 형식 증명은 하드웨어와 소프트웨어 시스템을 수학적 항으로 묘사하기를 요구합니다. 그리고 그때 그들의 올바름에 대한 주장을 세우는 것은 정리 증명의 형태가 됩니다.

source: In previous Lean versions, users often found it cumbersome to have to include these extra discriminants.
ko: 린의 이전 버전에서 사용자는 이 별도의 구별자를 포함시켜야 하는 것이 종종 성가신 일임을 알았습니다.

source: In situations like this, it can be tedious to supply the arguments a b c, when they can be inferred from hab hbc.
ko: 그들이 hab hbc으로부터 추론될 수 있을 때, 인자 a b c를 제공하는 것은 번거로울 수 있습니다.

source: In that case, (x : α) → β is an element of Sort 0 as well, no matter which type universe α lives in.
ko: 그 경우 α가 어느 유형세계에 속하였든 상관없이 (x : α) → β도 Sort 0의 원소입니다.

source: In that case, given x : α, p x denotes the assertion that p holds of x.
ko: 이 경우 x : α가 주어진다면, p x는 p가 x가 성립한다는 주장을 지칭합니다.

source: In that case, the type (a : α) → β a denotes the type of functions f with the property that, for each a : α, f a is an element of β a.
ko: 이 경우 유형 (a : α) → β a는 모든 a : α에 대해, f a가 β a의 원소라는 성질로 f 함수의 유형을 지칭합니다.

source: In the Lean standard library, you often see Greek letters to denote types, and the Unicode symbol → as a more compact version of ->.
ko: 린의 표준 라이브러리에서 여러분은 유형을 나타내는데 그리스 문자를 자주 보게 됩니다. 그리고 유니코드 기호 → 은 ->보다 더 간결한 버전입니다.

source: In the next two examples, they are used to define functions which swap the components of the product and sum types:
ko: 다음 두 예제에서, 이들은 곱과 합 유형의 요소를 바꾸는 함수를 정의하는데 사용됩니다.

source: In the previous example, the proper value of the metavariable is determined by the tactic exact px, since px has type p x.
ko: 이전 예제에서 메타변수의 적절한 값은exact px 전략에 의해 결정됩니다. 그 이유는 px가 p x형을 갖기 때문입니다.

source: In the second expression, a is a variable, and the expression fun a => t2 has to make sense independently of the value of a.
ko: 두 번째 표현식에서 a는 변수이고 표현식 fun a => t2는 a의 값과 별개로 의미를 가져야 합니다.

source: In the successor step, assuming the value add m n is already determined, we define add m (succ n) to be succ (add m n).
ko: 계승자 단계에서 우리는 add m (succ n)이 add m (succ n)이 되도록 정의하여 값 add m n의 추정은 이미 결정되었습니다.

source: In the nil case, m is instantiated to 0, and noConfusion makes use of the fact that 0 = succ n cannot occur.
ko: nil 경우에서 m은 0으로 개체화되고 noConfusion은 0 = succ n이 일어날 수 없다는 사실을 사용하게 만듭니다.

source: In the above Lean code, the field add has type Add.add : {α : Type} → Add α → α → α → α where the curly braces around the type a mean that it is an implicit argument.
ko: 위의 린 코드에서 add은 Add.add : {α : Type} → Add α → α → α → α형 입니다. 여기서 유형 a 주위의 중괄호는 이것이 암시적인 인수임을 의미합니다.

source: In the base case, we set add m zero to m.
ko: 기저의 경우에서 우리는 add m zero를 m으로 설정합니다.

source: In the case of the apply tactic, the tags are inferred from the parameters names used in the And.intro declaration.
ko: apply 전략의 경우 표식은 And.intro에서 사용된 매개변수의 이름으로부터 추론됩니다.

source: In the case where p x has type Prop, if we replace (x : α) → β x with ∀ x : α, p x, we can read these as the correct rules for building proofs involving the universal quantifier.
ko: p x는 Prop형을 갖는 이 경우에 대해, 우리가 (x : α) → β x을 ∀ x : α, p x으로 대체한다면, 우리는 이것들을 전칭 한정기호를 포함한 증명을 만드는데 옳바른 규칙이라고 읽을 수 있습니다.

source: In the class HMul, the parameters α and β are treated as input values.
ko: 클래스 HMul에서 매개변수 α와 β는 입력값으로 취급됩니다.

source: In the current setting, it shows how to "introduce" or establish an implication.
ko: 지금 상황에서 그것은 "도입"을 어떻게 하는지 또는 함의를 어떻게 세우는지 보여줍니다.

source: In the editors, you can type the backwards arrow as \l.
ko: 편집자에게 여러분은 뒷방향 화상표를 이와 같이 칠 수 있습니다. \l

source: In the example below, notice that the hypothesis h : n ≠ 0 becomes h : 0 ≠ 0 in the first branch, and h : succ m ≠ 0 in the second.
ko: 아래 예제에서 가정 h : n ≠ 0이 첫 분기에서 h : 0 ≠ 0이 되고 두 번째 분기에서 h : succ m ≠ 0이 됨을 주목하세요.

source: In the example above we set the option codegen to false because the code generator currently does not support WellFounded.fix.
ko: 위의 예제에서 우리는 옵션 codegen이 실패하도록 설정했습니다. 왜냐하면 코드 생성기는 현재 WellFounded.fix를 지원하지 않기 때문입니다.

source: In the example above, it created the declaration replicate.loop for the let rec loop occurring at replicate.
ko: 위 예제에서 replicate에서 생긴 let rec loop에 대해 replicate.loop 선언을 만듭니다.

source: In the example above, def m : Nat := 1 defines a new constant m of type Nat whose value is 1.
ko: 위 예제에서 def m : Nat := 1는 1을 값으로 갖는 새로운 상수 m을 Nat유형으로 정의합니다.

source: In the example above, the command apply And.intro yields two subgoals:
ko: 위의 예에서 apply And.intro 명령은 두 하위 목표를 얻습니다.

source: In the example above, the first use of rw replaces k with 0 in the goal f k = 0.
ko: 다음 예제에서 rw의 첫 번째 사용은 목표 f k = 0에서 k를 0으로 대체합니다.

source: In the example above, the inaccessible annotation makes it clear that f is not a pattern matching variable.
ko: 위 예제에서 접근불가 주석은 f가 패턴 매칭 변수가 아님을 명확히 합니다.

source: In the example above, we defined two instances.
ko: 위의 예제에서 우리는 두 개체를 정의 했습니다.

source: In the examples below, the minus sign and only are used to block the application of reverse_mk_symm.
ko: 아래 예제에서 음의 부호와 only는 reverse_mk_symm의 활용을 막는데 사용됩니다.

source: In the examples below, we will henceforth use Lean's version of the natural numbers.
ko: 아래 예제에서 우리는 이후부터 자연수의 린 버전을 사용할 것입니다.

source: In the examples, we have also made use of additional types like Bool, Nat, and Int, and type constructors, like List, and product, ×.
ko: 예제에서 우리는 Bool, Nat, and Int 같은 추가 유형과 유형 생성자 List과 product, ×의 사용을 보았습니다.

source: In the exercises below, we encourage you to prove as many as you can.
ko: 아래 연습 문제에서 여러분이 할 수 있는 가능한 많이 증명해보길 권합니다.

source: In the exercises below, you are asked to spell out the details.
ko: 아래 연습에서 여러분은 세부 사항을 말하도록 요청받습니다.

source: In the exposition below, we will slip back and forth between these two ways of talking, at times saying that an expression "constructs" or "produces" or "returns" a proof of a proposition, and at other times simply saying that it "is" such a proof.
ko: 아래의 설명에서 우리는 두 말하기 방식 사이를 앞뒤로 다닐 것인데, 어떤 표현은 명제의 증명을 "구성" 또는 "생성", "반환"을 말하고, 어떤 표현은 단순히 "그것"이라고 말합니다.

source: In the expression Or.elim hpq hpr hqr, Or.elim takes three arguments, hpq : p ∨ q, hpr : p → r and hqr : q → r, and produces a proof of r.
ko: 표현식 Or.elim hpq hpr hqr과 Or.elim은 세 인수 hpq : p ∨ q, hpr : p → r 그리고 hqr : q → r를 받습니다. 그리고 r의 증명을 만듭니다.

source: In the first case, we simply specify a target value with the appropriate type, as before.
ko: 첫 번째 경우에서 우리는 단순히 이전처럼 적절한 유형으로 대상 값을 명시할 수 있습니다.

source: In the first branch, we have the hypothesis h₁ : m < n, and in the second we have the hypothesis h₂ : m ≥ n.
ko: 첫 분기에서 우리는 가정 h₁ : m < n을 갖고 두 번째에서 우리는 가정 h₂ : m ≥ n을 갖습니다.

source: In the first case, the function returns 2 * n, and the second case, it returns 2 * n + 1.
ko: 첫 번째 경우는 함수는 2 * n을 반환하고 두 번째 경우는 2 * n + 1을 반환합니다.

source: In the first example above, the first step rewrites a + b + c to a + (b + c).
ko: 첫 예제에서 처음 절차는 a + b + c을 a + (b + c)으로 다시 씁니다.

source: In the first example, the left branch succeeds, whereas in the second one, it is the right one that succeeds.
ko: 첫 예제에서 왼쪽 분기는 성공했습니다. 반면 두번째에서 성공한 것은 오른쪽의 것입니다.

source: In the first example, the left-hand side of the equality in the goal is simplified using the usual identities involving 0 and 1, reducing the goal to x * y = x * y.
ko: 첫 예제에서 목표 속 등식의 좌변은 0과 1을 포함한 평범한 항등식을 사용해 단순화해 목표를 x * y = x * y으로 축소합니다.

source: In the first expression, you should think of every instance of a in t2 as a syntactic abbreviation for t1.
ko: 첫 번째 표현식에서, 여러분은 t2속 a의 모든 개체를 t1에 대한 문법적 약어로 생각해야 합니다.

source: In the following example, the tactic rename_i h1 _ h2 renames two of the last three hypotheses in your context.
ko: 다음 예제에서는 rename_i h1 _ h2 전략이 여러분의 상황 속 세 가정 중 마지막 두 개의 이름을 바꿉니다.

source: In the following example, two different lambda expressions are created.
ko: 다음 예제에서 다른 두 가지 람다 표현식이 만들어집니다.

source: In the following example, we use this basic form to rewrite the goal using a hypothesis.
ko: 다음 예제에서 우리는 이 기본 형태를 가정을 사용하여 목표를 다시 쓰는데 사용합니다.

source: In the following example, we define even a as ∃ b, a = 2*b, and then we show that the sum of two even numbers is an even number.
ko: 다음 예제에서 우리는 짝수 a를 ∃ b, a = 2*b와 같이 정의합니다. 그런 뒤 두 짝수의 합이 짝수임을 보일 것 입니다.

source: In the following example, we define the notation triv using the command syntax.
ko: 다음 에제에서 우리는triv기호를 syntax 명령을 사용해 정의한다.

source: In the following example, we prove symm and leave as exercise the theorems trans and congr (congruence).
ko: 다음 예제에서 우리는symm을 증명합니다. 그리고 정리 trans과 congr (적합, congruence)을 연습으로 남겨놓겠습니다.

source: In the following example, we use Or.elim to prove p ∨ q → q ∨ p.
ko: 다음 예제에서 우리는 Or.elim을 p ∨ q → q ∨ p을 증명하는데 사용합니다.

source: In the following example, we use rw [h] at t to rewrite the hypothesis t : Tuple α n to t : Tuple α 0.
ko: 다음 예제에서 우리는 가정 t : Tuple α n을 t : Tuple α 0으로 다시쓰도록 rw [h] at t을 사용합니다.

source: In the following example, we use output parameters to define a heterogeneous polymorphic multiplication.
ko: 다음 예제에서 우리는 출력 매개변수를 이질적인 다형적 곱셈을 정의하는데 사용합니다.

source: In the following examples, we illustrate the interaction between named and default arguments.
ko: 다음 예제에서 우리는 이름 지어진 것과 기본 인자 사이의 상호작용을 설명합니다.

source: In the last #eval, note that the instance was used twice on an array of arrays.
ko: 지난 #eval에서 배열의 배열에 대해 개체가 두 번 사용되었음을 주목하세요.

source: In the last chapter we observed that lambda abstraction can be viewed as an "introduction rule" for →.
ko: 지난 장에서 우리는 람다 추상화가 →에 대한 "도입 규칙"으로 본 적이 있습니다.

source: In the latter case, let us say that (the type associated with) p is inhabited.
ko: 후자의 경우에서 (연관된 유형)p은 머무른다고 말합시다.

source: In the meanwhile, here we explain how to use it.
ko: 한편, 여기서는 어떻게 그것을 사용할지 설명합니다.

source: In the meanwhile, think about what is going on in these examples.
ko: 한편, 이 예제에서 무슨 일이 일어나는 건지 생각해보세요.

source: In the next chapter, we will describe Lean's function definition package, which provides even more convenient ways to define functions on inductive types and carry out inductive proofs.
ko: 다음 장에서 우리는 린의 정의 패키지를 설명합니다. 이 패키지는 함수와 귀납형과 귀납 증명을 수행하는 심지어 더 편리한 방법을 제공합니다.

source: In the next chapter, you will learn how to define a function like add so that it works generically for elements of Point α rather than just Point Nat, assuming α has an associated addition operation.
ko: 다음 장에서 여러분은 add같은 함수를 어떻게 정의하는지 배울 것입니다. 그래서 그저 Point Nat보다는 Point α의 원소에 대해 일반적으로 동작하도록 할 것입니다. 여기서 α는 덧셈 연산과 연관이 있다고 가정합시다.

source: In the next example we use And.intro to create a proof of p → q → p ∧ q.
ko: 다음 예제에서 우리는 And.intro를 p → q → p ∧ q의 증명을 만들기 위해 사용합니다.

source: In the next example, for example, we choose the name m for the argument to succ, so that the second case refers to succ m.
ko: 다음 예제에서 예를들어 우리는 이름m을 succ에 대한 인수로 선택하여 두 번쨰 경우가 succ m을 참조하도록 합니다.

source: In the next example, the second constructor succeeds on the right conjunct q ∧ r (remember that disjunction and conjunction associate to the right) but fails on the first.
ko: 다음 예제에서 두 번째 constructor는 오른쪽 결합자 q ∧ r(분리자와 결합자는 오른쪽 결합성을 가짐을 기억하세요.)에서 성공합니다. 그러나 첫 번째에서는 실패합니다.

source: In the next example, we define a structure using multiple inheritance, and then define an object using objects of the parent structures.
ko: 다음 예제에서 우리는 다수의 상속을 사용한 구조체를 정의하고 그 후 부모 구조체의 대상을 사용하는 대상을 정의합니다.

source: In the next three examples, the same compound tactic succeeds in each case.
ko: 다음 세 예제에서 동일한 복합 전략은 각 경우에서 성공합니다.

source: In the next three sections, we will describe, respectively:
ko: 다음 세 섹션에서 우리는 개별적으로 설명할 예정입니다.

source: In the previous chapter, we saw that inductive definitions provide a powerful means of introducing new types in Lean.
ko: 이전 장에서 우리는 귀납적 정의가 린의 새 유형을 도입하는 강력한 수단을 제공함을 보았습니다.

source: In the previous section, we have shown how implicit arguments make functions more convenient to use.
ko: 이전 섹션에서 우리는 어떻게 암시적인 인자가 함수를 쓰기 더 편리하게 만드는지 보았습니다.

source: In the propositions-as-types paradigm, theorems involving only → can be proved using lambda abstraction and application.
ko: 유형으로써 명제 패러다임에서 →만을 포함하는 정리는 람다 추상화와 적용을 사용해 증명될 수 있습니다.

source: In the second case, however, the recursor can assume that a value of f at n has already been computed.
ko: 그러나 두 번째 경우에서 재귀자는 n에서 f의 값이 이미 계산되었음을 가정합니다.

source: In the second example, simp reduces the goal to p (x * y), at which point the assumption h finishes it off.
ko: 두 번째 예제에서 simp는 목표를 p (x * y)으로 축약합니다. 이점에서 가정 h가 이를 끝냅니다.

source: In the second pair of examples below, this mechanism is used to specify the desired types of the expressions id and List.nil:
ko: 아래 예제의 쌍의 두 번째에서, 이 메커니즘은 식 id와 List.nil의 바람직한 유형을 명시하는데 사용됩니다.

source: In the second presentation, the patterns overlap; for example, the pair of arguments 0 0 matches all three cases.
ko: 두 번째 나타남에서 패턴은 겹칩니다. 예를 들어 인수의 쌍 0 0은 세 경우 모두 일치합니다.

source: In the section after next we will see what happens when the constructor of an inductive type takes arguments from the inductive type itself.
ko: 이 섹션 다음에 우리는 귀납형의 생성자가 자기 자신의 귀납형으로부터 인수를 받을 때 무슨 일이 생기는지 알아볼 것입니다.

source: In the semantics of dependent type theory, there is no built-in notion of a partial function.
ko: 의존 유형론의 의미론에서 부분 함수의 내장 개념은 없습니다.

source: In the standard library, Decidable is defined formally as follows:
ko: 표준 라이브러리에서 Decidable은 다음과 같이 형식적으로 정의됩니다.

source: In the type theory literature, there are further generalizations of inductive definitions, for example, the principles of induction-recursion and induction-induction.
ko: 유형론 교재에서는 재귀적 정의의 더 일반화 예를 들어 induction-recursion과 induction-induction의 원리가 있습니다.

source: In these languages, the interpreter produces an exception or returns an arbitrary value for incomplete cases.
ko: 이 언어들에서 인터프리터는 예외을 만들거나 불완전한 경우에 대한 임의의 값을 반환합니다.

source: In this section and the next, we discuss them in greater detail.
ko: 이 섹션과 다음에서 우리는 이들에 대해 더 자세히 논의할 것입니다.

source: In this case you can think of def as a kind of named lambda.
ko: 이 경우 여러분은 def를 lambda와 같은 종류로 생각할 수 있습니다.

source: In this case, detecting the possibility of well-founded recursion on the natural numbers, it uses the usual lexicographic ordering on the pair (x, y).
ko: 이 경우 자연수에 대한 잘 세워진 재귀의 가능성을 감지하여 순서쌍 (x, y)에 대해 평범한 사전적 순서를 사용합니다.

source: In this case, each can be used to reduce the proof to:
ko: 여기서 각각은 증명을 다음과 같이 간단히 하는데 사용됩니다.

source: In this case, the any_goals tactic provides a more robust solution.
ko: 여기서 any_goals 전략은 더 강건한 답을 제공합니다.

source: In this chapter, we extend the repertoire of logical constructions to include the universal and existential quantifiers, and the equality relation.
ko: 이번 장에서는 우리는 전칭과 존재 한정기호와 동등 관계를 포함한 논리 구축 레퍼토리를 확장합니다.

source: In this chapter, we describe an alternative approach to constructing proofs, using tactics.
ko: 이 장에서는 전략을 사용하여 증명을 생성하는 대체 접근 방식을 설명합니다.

source: In this chapter, we will begin to explain how to write mathematical assertions and proofs in the language of dependent type theory as well.
ko: 지금까지, 여러분들은 린에서 객체와 함수를 정의하는 몇가지 방법을 배웠습니다.
